[
    {
        "title": "Honeymoon Day 3: Be a diver in a world of swimmers", 
        "date": "2025-07-24", 
        "content": "The gifts God imparts on us are not evenly distributed. Swimming was a gift bestowed upon many. Diving was only given to a few. Today we learned that I am one of the few. Please see the gallery for specifics.", 
        "images": [
            "conzydiving.PNG"
        
        ]
    } ,
    {
  "title": "Honeymoon Day 2: First dip in the Pacific Ocean",
  "date": "2025-07-23",
  "content": "Today I touched the Pacific Ocean for the very first time. And today Colin touched the Pacific Ocean for the hundred millionth time.<br><br>The breakdown of activities on the eleven hour flight goes like this:<br><br>- 50 minutes of “Invictus” (I love sports movies but this was a little too political, boring and slow)\n- 2 hours of eating\n- 1 minute of standing time\n- 2 hours to get this blog’s GitHub repo up and running\n- and 1 hour naps sandwhiching each activity.<br><br>We found that the best way to sleep is, the neck pillow holder has to clip in on backwards (important). The holder has to lean toward the non holder and put their arm in the non holder's lap to give the non holder the correct angle to also use the pillow.<br><br>We landed in Kauai, got the rental car, and went to Walmart to stock up (haul in the gallery below). We got the first iced coffee of the trip and drove the rest of the way to the Airbnb in Princeville, Kauai. Princeville seems to be this ginormous community of vacation homes. It feels like I’m in a southern Florida resort in the middle of the jungle.\n\nWe check into the Airbnb, grab some dinner (Singapore noodles and a chicken quesadilla), and head to Hanalei beach. Colin jumps off of the pier leaving me no choice but to also jump off the pier and we watch our first beach sunset together hanging onto the boogie board.\n\nAfter sunset, we go home, grab two Angry Orchards and spend the next two hours switching between pool and jacuzzi before passing out after a 24 hr day from start to finish (naps included).",
  "images": [
    "conzyhonalei.jpg",
    "honalei.jpg",
    "honaleiwater.jpg",
    "walmart.jpg",
    "airport.jpg",
    "princevillelunch.jpg"
    
  ]
},
  {
    "title": "Honeymoon Day 1: Flight delayed for a bajillion hours, never made it to Hawaii",
    "date": "2025-07-22",
    "content": "As our blood pressure comes down and bills come in from what many people (>2) said was the best wedding they have ever attended, Colin and I are now sitting on an eleven-hour plane from Boston to Honolulu. As soon as it was confirmed that we wouldn’t be deboarding this plane for the third time in 24 hours, we buttoned on our new neck pillow—our inaugural purchase as husband and wife—and knocked out for the first hour. We just ate a wonderful cinnamon apple crepe and scrambled egg meal (with the best honeydew melon I’ve had in a while). Colin has taken custody of the neck pillow for a solo nap part two, and I am beginning our travel diary. This was requested by my mom, who is back at home in NC expecting a 'detailed account of everything we do'.<br><br><aside><strong>Aside:</strong> There was just an intercom announcement: “We are paging a passenger named Zoe Huang. We have your Kumon folder up here.”<br>Poor Zoe tried ditching her Kumon bag before the Hawaii vacation and they got her 🤣.</aside><br><h3>Night one in Hawaii (Logan Airport Hilton)</h3>The first time we deboarded was 8am yesterday. After an hour delay (mechanical issues), we got on the plane, strapped on the neck pillow, and were out within 5 minutes. About an hour later, I was shaken awake for what I expected to be a meal service. Actually, it was the flight attendant shaking us awake, informing us about the first deboard. We hadn’t even left the gate. Apparently, as the plane was waiting for signoff from the mechanical issues, the interior had gotten too hot for passengers to continue waiting. While we assured the attendant that we were perfectly fine and that this was great napping temperature, we found ourselves back in terminal E11 for the second time. We deboard, sit back down in the terminal, and start calling Airbnb, Hertz, and Hawaiian Airlines to minimize itinerary damage.<br><br>A little while later, we spot Tegan walking to her gate! We flag her down and are significantly happier to have a buddy to wait with as Hawaiian figures out their issues. About two hours in E11 later, the plane is finally ready. We board and settle in for the second time. About another hour later, we’re informed that while they were waiting on the final maintenance signoff, the cabin crew timed out, and FAA regulations prohibit them from working the eleven-hour flight. We deboard again. At the gate, we see the entire plane queue at the Hawaiian gate desk. Colin and I decide we want nothing to do with this line and instead go to the very front and sit in a chair where we can hear all the conversations to try to figure out what they’re telling people. We hear that they are rebooking the whole flight for 6am the next day and comping a night in the Hilton attached to the airport. The ridiculously long line is to get food vouchers and hotel info.<br><br>In between people being helped, I throw the attendant a clarifying question and she asks if we just want to skip the line. Yes. We jump up there, get our $80 worth of airport food vouchers and hotel info. Annoyingly, Hawaiian makes us wait at E11 for 2 more hours, but this gives Colin time to try and salvage the missed bookings due to the delay. We pick up some to-go Davio’s, a really nice steakhouse in the airport, with the vouchers. We head back to the hotel, get a workout in at the gym, and spend the rest of the evening in the jacuzzi with McKinley (3-year-old birthday girl who was also on the cancelled plane). We end the unconventionally and unexpectedly fun night with Davio’s overlooking a beautiful Logan Airport and Boston harbor. Enjoy pictures from the Hilton hotel, the walk to the Hertz counter across the Logan highway, etc...",
    "images": [
        "airp.jpg",
        "hilton.jpg",
        "hertx.jpg"
        

  
    ]
  }



]

