[
  {"title": "Honeymoon Day 5: The fish don't know their place", 
  "date": "2025-07-26", 
  "content": "After another leisurely wakeup, we dilly dally out the door and to Haley’s favorite acai and coffee combo at Kauai.<br><br>Now, the only acai bowl I’ve ever had is the PB cup from Life Alive. I LOVE this acai bowl. Specifically, I think I really like the mound of fudge they throw in there. So I asked Colin to order for me, the most chocolatey bowl. While the acai was notably smooth and creamy and tasted very good, to my disappointment, there was no chocolate to be found anywhere. This leads me to conclude that I probably am not a lover of acai, just chocolate.<br><br>The coffee shop Haley recommended was not open, so we decide there is no better time than now to complete the task Mr. Weaver gave us of finding out if the other coffee shop that consistently has a 30 foot line right outside the resort is any good. We eat the acai bowl in the 30 minute coffee shop line, and finally order a Salted Vanilla Iced Latte. Now, I know this is probably not what anyone wants to hear, but the coffee was really freaking good. HOWEVER, I still have to try Haley’s recommendation to compare.<br><br>After this, we grab some lunch at Bubba’s Burgers, and rent Colin’s surfboard for the day. He gets a few good waves outside of the hotel and we knock out for another two hour nap.<br><br>Post-nap is snorkeling time. We drive over to the spot, let Colin catch a few more waves, and gear up. Now that I look absolutely ridiculous, it’s time to snorkel. I flipper out there, Colin puts a melting plastic bag of fish food in my hand, and I am now expected to go under the water and perform. However, I am pretty flustered here with the new gear and lack of solid footing. My brain to body connection lags and the first snorkel I try to do results in a throat full of saltwater.<br><br>After this disastrous start, Colin increases the pressure by telling me the fish are circling me and I better get a grip. I spit out the water, shove the spout back in my mouth, submerge myself, and start to try to slowly release the fish food. Circling back to the fact that I look absolutely ridiculous (picture), the fish have little to no respect for me and for the food chain. A fish SNATCHES THE BAG out of my closed fist and I decide the rest of my time is better spent with the GoPro.<br><br>Then, we catch the last few minutes of the sunset requested by Emily and take a nice walk on the beach.<br><br>For dinner I make Colin and I some bomb sandwiches, he attempts to microwave frozen pizza (fail), and we watch Life After Lockup. Here is a review of my sandwich:<br><br><strong>Colin’s review of Conzy’s Sandwich:</strong><br><br>Conzy’s sandwich, constructed of in bottom to top order: Hawaiian bread, mayo, perfectly centered folded ham, perfectly centered folded turkey, mayo, cheese, mayo, perfectly centered folded ham, perfectly centered folded ham, mayo, Hawaiian bread, and toasted for 30 seconds, hit the most scrumptious combinations of the materials provided. A perfect warmth, creamy mayo layers that satiated my mouth without globbing due to perfect distribution, and a perfect ham, cheese, bread ratio.",
  "images": [
  "conzyunthreatening.png", 
  "fishstealfishfood.png",
  "colinsurf.JPG",
  "surfboard.JPG",
  "colinaftersurf.JPG",
  "conzyburg.JPG",
  "colinburg.JPG",
  "colinwalk.JPG",
  "colinwalk2.JPG",
  "colinele.JPG"

]  },

    {"title": "Honeymoon Day 4: Questionable facials",
    "date": "2025-07-25",
    "content": "I woke up to my second banana pancake breakfast and our last morning on the north shore. We leisurely checked out of the Airbnb, and made our way to the expedition of the day: a jungle tunnel tubing tour.<br><br>We gear up with our stolen (from Chris) GoPro, $20 Amazon water shoes (already torn open by my big toe during Fourth of July white water rafting with Uma), and a good attitude 😉. We rip down a bumpy dirt road in a tour bus and get loaded onto “military grade inner tubes”. We’re moved along 5 separate tunnels, each with their history narrated by the guides.<br><br>Colin decides to give himself a facial (war paint) with the tunnel mud and he must have done quite a good job as the tour guide asked him for his workout split.<br><br>After the tubing tour, we eat some ham and cheeses and head to Poipu Beach, where we will spend the rest of our trip. We are staying at a beautiful resort with surfable waves right outside, two pools, and 3 jacuzzis.<br><br>We eat a lovely (but not nearly as good as Fiesta Grill) Mexican dinner, and once again, hit the jacuzzis with an Angry Orchard each. We meet and chat with the most average high school senior ever (GTA, wants to study chemistry because he saw Breaking Bad, and wants to set up a blackjack operation in the cafeteria senior year), watch the stars for awhile (and a shooting star!) and call it a day. There are not many pictures from today unfortunately, but there is great GoPro footage that I'll sort through later. <br><br>So far on this trip, the total number of times we have had this exact conversation:<br><br>“So where do you guys go to school”<br>“MIT”<br>“Ooh so you guys must be smart”<br><br>Is 4. The best response we have so far is “That’s what they say”. Other contenders are “Yes”, “Sometimes”, “Yeah, geniuses actually”, and “No”…<br><br>We are open to suggestions.",
    "images":[
        "junglecolin.jpg",
        "jungleconzy.jpg",
        "junglepic.jpg",
        "conzyjungle.jpg",
        "colinjungle.jpg",
        "marketconzy.JPG"
    ]

},
    {
        "title": "Honeymoon Day 3: Knowing how to swim is boring. Perfect diving form is not.", 
        "date": "2025-07-24", 
        "content": "The gifts God imparts on us are not evenly distributed. Swimming was a gift bestowed upon many. Diving was only given to a few. Today we learned that I am one of the few. Please see the gallery for specifics and make note of the pointed toes.<br><br>I woke up to a lovely arrangement of banana pancakes accompanied by “Banana Pancakes” by Jack Johnson coming out of Colin’s phone speaker.<br><br>Our first stop is Haena Beach; Haley’s favorite. We bring our entire beach setup (umbrella, towels, volleyball and chips), claim an entire gulf for ourselves and do nothing for the next hour. The only problem I have on the beach is the sand is always being blown directly into my face when I try to lay down. I am open to fixes from more seasoned beachers.<br><br>When the boredom and the crowd start rolling in, we pack up and head to a little market and food area for an infamous “chicken and shaved ice” lunch. The chicken was very good and included in the experience was Colin marveling at the size of the chicken. “Look I can cut a steak out of this!” “This must have been a FAT chicken!”…<br><br>Unfortunately, neither of us are college athletes anymore and did not have the capacity for 30 ounces of shaved ice after this chicken meal.<br><br>My favorite part of lunch, however, was when my new husband suggested a nap. He has this whole trip planned down to the hour in his Google Calendar; I wasn’t sure where that left us in terms of post-lunch naps. So after a full two-hour nap, multiple REM cycles, and a coffee, we are ready for the highly anticipated Queen’s Bath.<br><br>If there is an activity on this trip where I am most likely to have a medical emergency, it’s at Queen’s Bath. Queen’s Bath is a naturally formed tide pool where waves are constantly surging in and either pulling you out toward the ocean or into the tide pool. The key to a good time is to time the swells correctly before the jump and to not panic (I am told).<br><br>As my swimming competency levels are low, Colin has struggled with the decision of whether to let me participate in this jump or not. He decides it’s a calm enough day and I do wonderfully under pressure. In his own words, I kept my composure and exceeded expectations. It was really awesome.<br><br>We return home, go get some JoJo’s shaved ice (which was very good but I am told the Weavers are loyal Uncle’s shaved ice fans), eat some frozen lasagna, and Jacuzzi.",
        "images": [
            "conzydiving.PNG", 
            "diving2.jpeg",
            "banana.jpg",
            "chicken.jpg",
            "DSC03100.JPG",
            "DSC03110.JPG",
            "DSC03114.JPG",
            "DSC03117.JPG",
            "DSC03137.JPG",
            "c.jpg", 
            "shavedice.jpg",
            "queens.jpg",
            "bad.jpg",
            "fishbad.jpg"
        ]
    } ,
    {
  "title": "Honeymoon Day 2: First dip in the Pacific Ocean",
  "date": "2025-07-23",
  "content": "Today I touched the Pacific Ocean for the very first time. And today Colin touched the Pacific Ocean for the hundred millionth time.<br><br>The breakdown of activities on the eleven hour flight goes like this:<br><br>- 50 minutes of “Invictus” (I love sports movies but this was a little too political, boring and slow)\n- 2 hours of eating\n- 1 minute of standing time\n- 2 hours to get this blog’s GitHub repo up and running\n- and 1 hour naps sandwhiching each activity.<br><br>We found that the best way to sleep is, the neck pillow holder has to clip in on backwards (important). The holder has to lean toward the non holder and put their arm in the non holder's lap to give the non holder the correct angle to also use the pillow.<br><br>We landed in Kauai, got the rental car, and went to Walmart to stock up (haul in the gallery below). We got the first iced coffee of the trip and drove the rest of the way to the Airbnb in Princeville, Kauai. Princeville seems to be this ginormous community of vacation homes. It feels like I’m in a southern Florida resort in the middle of the jungle.\n\nWe check into the Airbnb, grab some dinner (Singapore noodles and a chicken quesadilla), and head to Hanalei beach. Colin jumps off of the pier leaving me no choice but to also jump off the pier and we watch our first beach sunset together hanging onto the boogie board.\n\nAfter sunset, we go home, grab two Angry Orchards and spend the next two hours switching between pool and jacuzzi before passing out after a 24 hr day from start to finish (naps included).",
  "images": [
    "conzyhonalei.jpg",
    "honalei.jpg",
    "honaleiwater.jpg",
    "walmart.jpg",
    "airport.jpg",
    "princevillelunch.jpg"
    
  ]
},
  {
    "title": "Honeymoon Day 1: Flight delayed for a bajillion hours, never made it to Hawaii",
    "date": "2025-07-22",
    "content": "As our blood pressure comes down and bills come in from what many people (>2) said was the best wedding they have ever attended, Colin and I are now sitting on an eleven-hour plane from Boston to Honolulu. As soon as it was confirmed that we wouldn’t be deboarding this plane for the third time in 24 hours, we buttoned on our new neck pillow—our inaugural purchase as husband and wife—and knocked out for the first hour. We just ate a wonderful cinnamon apple crepe and scrambled egg meal (with the best honeydew melon I’ve had in a while). Colin has taken custody of the neck pillow for a solo nap part two, and I am beginning our travel diary. This was requested by my mom, who is back at home in NC expecting a 'detailed account of everything we do'.<br><br><aside><strong>Aside:</strong> There was just an intercom announcement: “We are paging a passenger named Zoe Huang. We have your Kumon folder up here.”<br>Poor Zoe tried ditching her Kumon bag before the Hawaii vacation and they got her 🤣.</aside><br><h3>Night one in Hawaii (Logan Airport Hilton)</h3>The first time we deboarded was 8am yesterday. After an hour delay (mechanical issues), we got on the plane, strapped on the neck pillow, and were out within 5 minutes. About an hour later, I was shaken awake for what I expected to be a meal service. Actually, it was the flight attendant shaking us awake, informing us about the first deboard. We hadn’t even left the gate. Apparently, as the plane was waiting for signoff from the mechanical issues, the interior had gotten too hot for passengers to continue waiting. While we assured the attendant that we were perfectly fine and that this was great napping temperature, we found ourselves back in terminal E11 for the second time. We deboard, sit back down in the terminal, and start calling Airbnb, Hertz, and Hawaiian Airlines to minimize itinerary damage.<br><br>A little while later, we spot Tegan walking to her gate! We flag her down and are significantly happier to have a buddy to wait with as Hawaiian figures out their issues. About two hours in E11 later, the plane is finally ready. We board and settle in for the second time. About another hour later, we’re informed that while they were waiting on the final maintenance signoff, the cabin crew timed out, and FAA regulations prohibit them from working the eleven-hour flight. We deboard again. At the gate, we see the entire plane queue at the Hawaiian gate desk. Colin and I decide we want nothing to do with this line and instead go to the very front and sit in a chair where we can hear all the conversations to try to figure out what they’re telling people. We hear that they are rebooking the whole flight for 6am the next day and comping a night in the Hilton attached to the airport. The ridiculously long line is to get food vouchers and hotel info.<br><br>In between people being helped, I throw the attendant a clarifying question and she asks if we just want to skip the line. Yes. We jump up there, get our $80 worth of airport food vouchers and hotel info. Annoyingly, Hawaiian makes us wait at E11 for 2 more hours, but this gives Colin time to try and salvage the missed bookings due to the delay. We pick up some to-go Davio’s, a really nice steakhouse in the airport, with the vouchers. We head back to the hotel, get a workout in at the gym, and spend the rest of the evening in the jacuzzi with McKinley (3-year-old birthday girl who was also on the cancelled plane). We end the unconventionally and unexpectedly fun night with Davio’s overlooking a beautiful Logan Airport and Boston harbor. Enjoy pictures from the Hilton hotel, the walk to the Hertz counter across the Logan highway, etc...",
    "images": [
        "airp.jpg",
        "hilton.jpg",
        "hertx.jpg"
        

  
    ]
  }



]

